# GetFluidTemperature Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceSettings..::..GetFluidTemperature Method
FabricationServiceSettings Class See Also
---
Gets the fluid temperature of the specified service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double GetFluidTemperature(
	FabricationService service
)
```

Visual Basic
---
```text
Public Function GetFluidTemperature ( _
	service As FabricationService _
) As Double
```

Visual C++
---
```text
public:
double GetFluidTemperature(
	FabricationService^ service
)
```

# ### Parameters
service
    Type: Autodesk.Revit.DB..::..FabricationService The service to lookup.
# ### Return Value
The temperature in Kelvin.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | service is not mapped to a fluid type and temperature. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace